In [2]:
import pandas as pd

In [3]:
data = pd.read_csv('C:\\Users\\conor\\Downloads\\Adops & Data Scientist Sample Data - Q1 Analytics.csv')

In [4]:
data.head()

                    ts user_id country_id site_id
0  2019-02-01 00:01:24  LC36FC        TL6   N0OTG
1  2019-02-01 00:10:19  LC39B6        TL6   N0OTG
2  2019-02-01 00:21:50  LC3500        TL6   N0OTG
3  2019-02-01 00:22:50  LC374F        TL6   N0OTG
4  2019-02-01 00:23:44  LCC1C3        TL6   QGO3G

## BDV

In [5]:
bv = data[data['country_id'] == 'BDV']

In [6]:
bv.head()

                     ts user_id country_id site_id
13  2019-02-01 00:47:58  LC3C22        BDV   N0OTG
32  2019-02-01 02:46:15  LC375A        BDV   5NPAU
87  2019-02-01 06:44:42  LC392E        BDV   N0OTG
88  2019-02-01 07:36:56  LC3FAE        BDV   5NPAU
94  2019-02-01 08:58:35  LC3AFF        BDV   3POLC

In [8]:
bv.groupby('site_id').user_id.nunique().sort_values(ascending=False)

site_id
5NPAU    544
N0OTG     90
3POLC      2
Name: user_id, dtype: int64

## Time Stamp

In [180]:
time_stamp = data[(data['ts'] >= "2019-02-03 00:00:00") &  (data['ts'] <= '2019-02-04 23:59:59')]

In [189]:
time_stamp.groupby(['user_id', 'site_id'])['country_id'].count().reset_index().sort_values(by='country_id', ascending=False)

    user_id site_id  country_id
417  LC3A59   N0OTG          26
3    LC06C3   N0OTG          25
493  LC3C9D   N0OTG          17
485  LC3C7E   3POLC          15
357  LC38EB   N0OTG           9
..      ...     ...         ...
273  LC36AA   5NPAU           1
274  LC36B2   5NPAU           1
275  LC36B3   5NPAU           1
276  LC36C4   N0OTG           1
745  LCFFC3   N0OTG           1

[746 rows x 3 columns]

## Last Site Visit

In [190]:
data['last_visit_time'] = data.groupby(['user_id'])['ts'].transform('max')

In [198]:
data.loc[data.ts == data.last_visit_time]

                       ts user_id country_id site_id      last_visit_time
1     2019-02-01 00:10:19  LC39B6        TL6   N0OTG  2019-02-01 00:10:19
2     2019-02-01 00:21:50  LC3500        TL6   N0OTG  2019-02-01 00:21:50
4     2019-02-01 00:23:44  LCC1C3        TL6   QGO3G  2019-02-01 00:23:44
11    2019-02-01 00:41:50  LCC3C3        QLT   5NPAU  2019-02-01 00:41:50
12    2019-02-01 00:42:13  LC39C8        TL6   QGO3G  2019-02-01 00:42:13
...                   ...     ...        ...     ...                  ...
3545  2019-02-07 23:44:34  LC3561        TL6   N0OTG  2019-02-07 23:44:34
3547  2019-02-07 23:55:07  LC3837        TL6   RT9Z6  2019-02-07 23:55:07
3548  2019-02-07 23:56:57  LC3F13        TL6   QGO3G  2019-02-07 23:56:57
3550  2019-02-07 23:58:56  LC35EB        TL6   QGO3G  2019-02-07 23:58:56
3552  2019-02-07 23:59:37  LC3842        HVQ   3POLC  2019-02-07 23:59:37

[1916 rows x 5 columns]

In [194]:
data.user_id.nunique()

1916

Looks like no instances of duplicates.

In [199]:
data.loc[data.ts == data.last_visit_time]['site_id'].value_counts()

5NPAU    992
N0OTG    561
QGO3G    289
GVOFK     42
3POLC     28
RT9Z6      2
JSUUP      1
EUZ/Q      1
Name: site_id, dtype: int64

In [209]:
last_visit = data.loc[data.ts == data.last_visit_time][['user_id', 'site_id']]
last_visit.columns = ['user_id', 'last_site']

## First Site Visit

In [200]:
data['first_time_visit'] = data.groupby(['user_id'])['ts'].transform('min')

In [201]:
data.loc[data.ts == data.first_time_visit]

,ts,user_id,country_id,site_id,last_visit_time,first_time_visit
0,2019-02-01 00:01:24,LC36FC,TL6,N0OTG,2019-02-07 00:24:50,2019-02-01 00:01:24
1,2019-02-01 00:10:19,LC39B6,TL6,N0OTG,2019-02-01 00:10:19,2019-02-01 00:10:19
2,2019-02-01 00:21:50,LC3500,TL6,N0OTG,2019-02-01 00:21:50,2019-02-01 00:21:50
3,2019-02-01 00:22:50,LC374F,TL6,N0OTG,2019-02-03 04:50:43,2019-02-01 00:22:50
4,2019-02-01 00:23:44,LCC1C3,TL6,QGO3G,2019-02-01 00:23:44,2019-02-01 00:23:44
...,...,...,...,...,...,...
3542,2019-02-07 23:39:33,LC34C6,HVQ,GVOFK,2019-02-07 23:39:33,2019-02-07 23:39:33
3543,2019-02-07 23:41:25,LCC36A,TL6,N0OTG,2019-02-07 23:41:25,2019-02-07 23:41:25
3544,2019-02-07 23:42:35,LC34B8,TL6,QGO3G,2019-02-07 23:42:35,2019-02-07 23:42:35
3548,2019-02-07 23:56:57,LC3F13,TL6,QGO3G,2019-02-07 23:56:57,2019-02-07 23:56:57
3550,2019-02-07 23:58:56,LC35EB,TL6,QGO3G,2019-02-07 23:58:56,2019-02-07 23:58:56

In [206]:
first_visit = data.loc[data.ts == data.first_time_visit][['user_id', 'site_id']]
first_visit.columns = ['user_id', 'first_site']

In [210]:
total_visit = pd.merge(last_visit, first_visit, on=['user_id'], how='left')

In [211]:
total_visit

     user_id last_site first_site
0     LC39B6     N0OTG      N0OTG
1     LC3500     N0OTG      N0OTG
2     LCC1C3     QGO3G      QGO3G
3     LCC3C3     5NPAU      5NPAU
4     LC39C8     QGO3G      QGO3G
...      ...       ...        ...
1911  LC3561     N0OTG      3POLC
1912  LC3837     RT9Z6      5NPAU
1913  LC3F13     QGO3G      QGO3G
1914  LC35EB     QGO3G      QGO3G
1915  LC3842     3POLC      3POLC

[1916 rows x 3 columns]

In [213]:
len(total_visit.loc[total_visit.last_site == total_visit.first_site])

1670